var _levelScoreList = [ 
    [-200, -10, "奴隶"],
    [-180, -9, "奴仆"], [-160, -8, "奴仆"], [-140, -7, "奴仆"], 
    [-120, -6, "佣人"], [-100, -5, "佣人"], [-80, -4, "佣人"],
    [-60, -3, "长工"], [-40, -2, "长工"], [-20, -1, "长工"],

    [0, 0, "魔法学徒"], [20, 1, "魔法学徒"], [40, 2, "魔法学徒"], [60, 3, "魔法学徒"],
    [80, 4, "初级魔法师"], [100, 5, "初级魔法师"], [120, 6, "初级魔法师"],
    [140, 7, "中级魔法师"], [160, 8, "中级魔法师"], [180, 9, "中级魔法师"],
    [200, 10, "高级魔法师"], [220, 11, "高级魔法师"], [240, 12, "高级魔法师"], 
    [260, 13, "大级魔法师"],  [280, 14, "大级魔法师"],  [300, 15, "大级魔法师"], 

    [330, 16, "初级魔导师"], [360, 17, "初级魔导师"], [390, 18, "初级魔导师"], 
    [420, 19, "中级魔导师"], [450, 20, "中级魔导师"], [480, 21, "中级魔导师"], 
    [510, 22, "高级魔导师"],  [540, 23, "高级魔导师"],  [570, 24, "高级魔导师"],  
    [600, 25, "大魔导师"], [630, 26, "大魔导师"], [660, 27, "大魔导师"],  
    [690, 28, "圣魔导师"], [720, 29, "圣魔导师"], [750, 30, "圣魔导师"], 

    [800, 31, "天使"], [850, 32, "天使"], [900, 33, "天使"], 
    [950, 34, "大天使"], [1000, 35, "大天使"], [1050, 36, "大天使"], 
    [1100, 37, "炽天使"], [1150, 38, "炽天使"], [1200, 39, "炽天使"], 
    [1250, 40, "主天使"], [1300, 41, "主天使"], [1350, 42, "主天使"], 

    [1500, 43, "水之神"], [1600, 44, "水之神"], [1700, 45, "水之神"], 
    [1800, 46, "木之神"], [1900, 47, "木之神"], [2000, 48, "木之神"], 
    [2100, 49, "火之神"], [2200, 50, "火之神"], [2300, 51, "火之神"], 
    [2400, 52, "智慧主神"], [2500, 53, "智慧主神"], [2600, 54, "智慧主神"], 
    [2700, 55, "创造主神"], [2800, 56, "创造主神"], [2900, 57, "创造主神"], 
    [3000, 58, "永恒主神"], [3100, 59, "永恒主神"], [3200, 60, "永恒主神"], 
    [3300, 60, "至高神"], [3400, 61, "至高神"], [3500, 62, "至高神"], 
 ];

function getLevel( score ){


    for( var i = 0; i < _levelScoreList.length - 1; ++i ){
        if( score > _levelScoreList[i][0] &&  score < _levelScoreList[i + 1][0] ){
            return _levelScoreList[i];
        }
    }

    return _levelScoreList[ i ];

}

function adaptation( resourcePixel ){

    if( typeof(resourcePixel) == "undefined" ){
        resourcePixel = { width: 1920, height: 1080 }
    }

    var scalex = cc.director.getVisibleSize().width / resourcePixel.width;
    var scaley = cc.director.getVisibleSize().height / resourcePixel.height;

    return scalex > scaley ? scaley : scalex;
}